{
  "posts": [
    {
      "id": 1,
      "title": "El Caballero Oscuro",
      "description": "Una de las mejores películas de superhéroes de todos los tiempos.",
      "body": "Batman se enfrenta al caos desatado por el Joker, un criminal impredecible que pondrá a prueba su moralidad y determinación para proteger Gotham City.",
      "image": "https://pics.filmaffinity.com/the_dark_knight-102763119-large.jpg",
      "slug": "post-1",
      "genres": [
        "Acción",
        "Drama",
        "Crimen",
        "Película"
      ],
      "likes": 240
    },
    {
      "id": 2,
      "title": "Breaking Bad",
      "description": "La historia de un profesor de química convertido en fabricante de metanfetamina.",
      "body": "Walter White, diagnosticado con cáncer terminal, une fuerzas con un exalumno para asegurar el futuro financiero de su familia, adentrándose en el peligroso mundo del narcotráfico.",
      "image": "https://m.media-amazon.com/images/M/MV5BMzU5ZGYzNmQtMTdhYy00OGRiLTg0NmQtYjVjNzliZTg1ZGE4XkEyXkFqcGc@._V1_FMjpg_UX1000_.jpg",
      "slug": "post-2",
      "genres": [
        "Drama",
        "Crimen",
        "Thriller",
        "Serie"
      ],
      "likes": 320
    },
    {
      "id": 3,
      "title": "Interestelar",
      "description": "Un épico viaje interestelar para salvar a la humanidad.",
      "body": "Un grupo de astronautas viaja a través de un agujero de gusano en busca de un nuevo hogar para la humanidad, enfrentándose a desafíos inimaginables en el camino.",
      "image": "https://pics.filmaffinity.com/interstellar-366875261-large.jpg",
      "slug": "post-3",
      "genres": [
        "Ciencia Ficción",
        "Drama",
        "Aventura",
        "Película"
      ],
      "likes": 180
    },
    {
      "id": 4,
      "title": "La Casa de Papel",
      "description": "Un grupo de ladrones realiza el mayor atraco jamás imaginado.",
      "body": "Bajo el liderazgo de 'El Profesor', un grupo de ladrones con diferentes habilidades intenta robar la Fábrica Nacional de Moneda y Timbre de España, enfrentándose a desafíos emocionales y estratégicos.",
      "image": "https://pics.filmaffinity.com/la_casa_de_papel-844739080-large.jpg",
      "slug": "post-4",
      "genres": [
        "Drama",
        "Crimen",
        "Thriller",
        "Serie"
      ],
      "likes": 290
    },
    {
      "id": 5,
      "title": "El Señor de los Anillos: La Comunidad del Anillo",
      "description": "Una aventura épica para destruir un poderoso anillo.",
      "body": "Frodo y sus compañeros inician un peligroso viaje para destruir el Anillo Único y evitar que caiga en manos de Sauron, enfrentándose a enemigos y tentaciones a lo largo del camino.",
      "image": "https://pics.filmaffinity.com/the_lord_of_the_rings_the_fellowship_of_the_ring-952398002-large.jpg",
      "slug": "post-5",
      "genres": [
        "Fantasía",
        "Aventura",
        "Épica",
        "Película"
      ],
      "likes": 300
    },
    {
      "id": 6,
      "title": "Chernobyl",
      "description": "Una reconstrucción dramática del desastre nuclear de 1986.",
      "body": "La miniserie sigue los eventos que llevaron al desastre de Chernobyl y sus consecuencias, destacando el heroísmo de quienes arriesgaron sus vidas para mitigar la catástrofe.",
      "image": "https://pics.filmaffinity.com/chernobyl-183665235-large.jpg",
      "slug": "post-6",
      "genres": [
        "Drama",
        "Histórica",
        "Thriller",
        "Serie"
      ],
      "likes": 260
    },
    {
      "id": 7,
      "title": "Game of Thrones",
      "description": "La lucha por el Trono de Hierro en un mundo de fantasía épica.",
      "body": "En los Siete Reinos de Westeros, varias familias nobles compiten por el control del Trono de Hierro, mientras peligros sobrenaturales amenazan desde más allá del muro.",
      "image": "https://pics.filmaffinity.com/game_of_thrones-293142110-large.jpg",
      "slug": "post-7",
      "genres": [
        "Fantasía",
        "Drama",
        "Aventura",
        "Serie"
      ],
      "likes": 410
    },
    {
      "id": 8,
      "title": "Stranger Things",
      "description": "Un grupo de amigos enfrenta eventos sobrenaturales en Hawkins, Indiana.",
      "body": "Cuando un niño desaparece, sus amigos, una misteriosa niña con poderes y la comunidad de Hawkins descubren una dimensión oscura conocida como el Upside Down.",
      "image": "https://pics.filmaffinity.com/stranger_things-875025085-large.jpg",
      "slug": "post-8",
      "genres": [
        "Ciencia Ficción",
        "Aventura",
        "Suspense",
        "Serie"
      ],
      "likes": 370
    },
    {
      "id": 9,
      "title": "Avatar",
      "description": "Un exmarine se une a una raza alienígena para salvar su mundo.",
      "body": "Jake Sully, un exmarine parapléjico, se infiltra en la comunidad Na'vi en el planeta Pandora, pero pronto se convierte en su aliado en la lucha contra los intereses humanos destructivos.",
      "image": "https://pics.filmaffinity.com/avatar-208925608-large.jpg",
      "slug": "post-9",
      "genres": [
        "Ciencia Ficción",
        "Aventura",
        "Acción",
        "Película"
      ],
      "likes": 450
    },
    {
      "id": 10,
      "title": "The Mandalorian",
      "description": "Un cazarrecompensas se embarca en una aventura galáctica.",
      "body": "En los márgenes de la galaxia, un cazarrecompensas solitario se encuentra cuidando de un niño especial mientras evade enemigos y protege su misión.",
      "image": "https://pics.filmaffinity.com/the_mandalorian-299892082-large.jpg",
      "slug": "post-10",
      "genres": [
        "Ciencia Ficción",
        "Aventura",
        "Acción",
        "Serie"
      ],
      "likes": 340
    },
    {
      "id": 11,
      "title": "The Witcher",
      "description": "Un cazador de monstruos intenta encontrar su lugar en un mundo lleno de magia y conflictos.",
      "body": "Geralt de Rivia, un solitario brujo y cazador de monstruos, se enfrenta a decisiones morales mientras busca su destino en un mundo lleno de magia, humanos y criaturas sobrenaturales.",
      "image": "https://pics.filmaffinity.com/the_witcher-737807462-large.jpg",
      "slug": "post-11",
      "genres": ["Fantasía", "Aventura", "Acción", "Serie"],
      "likes": 410
    },
    {
      "id": 12,
      "title": "Parasite",
      "description": "Una familia pobre se infiltra en la vida de una familia rica con consecuencias inesperadas.",
      "body": "La familia Kim, con problemas económicos, encuentra la manera de trabajar para la familia Park. Sin embargo, las diferencias sociales y secretos oscuros llevan a un clímax impactante.",
      "image": "https://pics.filmaffinity.com/gisaengchung-432616131-large.jpg",
      "slug": "post-12",
      "genres": ["Drama", "Suspense", "Comedia Negra", "Película"],
      "likes": 490
    },
    {
      "id": 13,
      "title": "Padre no hay más que uno 4",
      "description": "La familia de Javier se enfrenta a nuevos desafíos y situaciones cómicas cuando decide pasar unas vacaciones juntos.",
      "body": "En esta cuarta entrega de la saga, Javier y su alocada familia deciden irse de vacaciones, pero las cosas nunca salen como esperaban. Desde imprevistos divertidos hasta situaciones que desatan los nervios de todos, Javier se ve nuevamente en la cuerda floja, intentando mantener la paz en un hogar lleno de caos. La película combina el humor familiar con situaciones cotidianas que todos pueden reconocer, logrando que el público se ría a carcajadas mientras se identifica con las peripecias de la familia. 'Padre no hay más que uno 4' es una de esas comedias que te recuerda lo importante que es disfrutar de los pequeños momentos, incluso cuando todo parece estar fuera de control.",
      "image": "https://pics.filmaffinity.com/padre_no_hay_mas_que_uno_4_campanas_de_boda-493339264-large.jpg",
      "slug": "post-13",
      "genres": ["Comedia", "Familia", "Película"],
      "likes": 2300
    },
    {
      "id": 14,
      "title": "Dark",
      "description": "Una historia de viajes en el tiempo que conecta generaciones en un pueblo alemán.",
      "body": "La desaparición de un niño revela secretos ocultos en el pueblo de Winden. A medida que los personajes viajan en el tiempo, descubren cómo sus vidas están entrelazadas en un ciclo eterno.",
      "image": "https://pics.filmaffinity.com/dark-111203947-large.jpg",
      "slug": "post-14",
      "genres": ["Ciencia Ficción", "Misterio", "Drama","Serie"],
      "likes": 670
    },
    {
      "id": 15,
      "title": "El Juego del Calamar",
      "description": "Un grupo de personas compite en juegos infantiles mortales por un premio millonario.",
      "body": "456 jugadores con dificultades económicas participan en una serie de juegos letales. Solo uno puede sobrevivir y llevarse el premio, mientras enfrentan dilemas morales y alianzas impredecibles.",
      "image": "https://pics.filmaffinity.com/squid_game-688981365-large.jpg",
      "slug": "post-15",
      "genres": ["Suspense", "Drama", "Acción", "Serie"],
      "likes": 940
    },
    {
      "id": 16,
      "title": "Inception",
      "description": "Un ladrón que roba secretos a través del uso de la tecnología de los sueños se enfrenta a su última misión.",
      "body": "Dominic Cobb, un experto en robar secretos a través de los sueños, recibe una oferta de redención: implantar una idea en la mente de una persona. A medida que se adentra en capas más profundas del subconsciente, los límites entre sueño y realidad comienzan a desdibujarse.",
      "image": "https://pics.filmaffinity.com/inception-652954101-large.jpg",
      "slug": "post-16",
      "genres": ["Ciencia Ficción", "Acción", "Suspense", "Película"],
      "likes": 850
    },
    {
      "id": 17,
      "title": "The Crown",
      "description": "La vida de la Reina Isabel II, desde su ascenso al trono hasta los eventos políticos y familiares que marcaron su reinado.",
      "body": "The Crown es una serie dramática que sigue la vida de la Reina Isabel II, explorando su reinado, los eventos históricos que definieron su reinado y las relaciones personales que formaron su vida en el trono de Inglaterra.",
      "image": "https://pics.filmaffinity.com/the_crown-838357032-large.jpg",
      "slug": "post-17",
      "genres": ["Drama", "Histórica", "Biografía", "Serie"],
      "likes": 780
    },
    {
      "id": 18,
      "title": "Black Mirror",
      "description": "Una serie de antología que examina los oscuros aspectos de la tecnología y su impacto en la sociedad moderna.",
      "body": "Cada episodio de Black Mirror se centra en un futuro cercano donde la tecnología ha llevado a situaciones inesperadas y perturbadoras. La serie explora cómo las innovaciones tecnológicas pueden volverse destructivas cuando se usan de manera incorrecta o cuando la humanidad se vuelve dependiente de ellas.",
      "image": "https://pics.filmaffinity.com/black_mirror-872421892-large.jpg",
      "slug": "post-18",
      "genres": ["Ciencia Ficción", "Terror", "Drama", "Serie"],
      "likes": 890
    },
    {
      "id": 19,
      "title": "Narcos",
      "description": "La historia real del auge y caída de los cárteles de droga en Colombia y la guerra contra las drogas en los años 80.",
      "body": "Narcos narra la vida de Pablo Escobar, el infame narcotraficante colombiano que llegó a ser uno de los hombres más ricos y peligrosos del mundo. La serie sigue la historia del crimen organizado en Colombia y el intento de la DEA por detenerlo, mientras se enfrentan a la violencia y la corrupción.",
      "image": "https://pics.filmaffinity.com/narcos-320030424-large.jpg",
      "slug": "post-19",
      "genres": ["Drama", "Crimen", "Historia", "Serie"],
      "likes": 1000
    },
    {
      "id": 20,
      "title": "De vuelta a la acción",
      "description": "Un ex agente secreto regresa para una última misión, donde deberá enfrentarse a un enemigo del pasado.",
      "body": "La película sigue a Jack, un ex agente secreto que lleva años alejado del mundo del espionaje. Sin embargo, su vida tranquila se ve interrumpida cuando un viejo enemigo regresa con un plan que podría cambiar el destino del mundo. Jack se ve obligado a regresar a la acción, enfrentando desafíos personales y peligros mortales. A medida que la trama avanza, las emociones se desatan y Jack deberá tomar decisiones difíciles para salvar el día. 'De vuelta a la acción' es una película de suspenso y acción que mantiene al espectador al borde de su asiento hasta el último minuto.",
      "image": "https://pics.filmaffinity.com/back_in_action-267182003-large.jpg",
      "slug": "post-20",
      "genres": ["Acción", "Suspenso", "Película"],
      "likes": 1500
    }
  ]
}